УТ_для_edt/src/BusinessProcesses/смартIECHOПродажа/смартIECHOПродажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>смартIECHOПродажа</name>
  <comment>//смарт:ММ #092 389 17.01.2021</comment>
  <task>Task.ЗадачаИсполнителя</task>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>DocumentRef.смартIECHOСпецификация</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КлиентСогласился</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлиентОтказалсяОтЗаказаНаЭтапеОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

УТ_для_edt/src/BusinessProcesses/смартIECHOПродажа/Forms/ФормаБизнесПроцесса/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	ОбновитьКартуСервер();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//Если ТекущийОбъект.Стартован Тогда
	//	РассчитатьСостояние();
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПодключитьОбработчикОжидания("ПроверкаИзмененийПоБП", 2);
	
КонецПроцедуры

// ++ 23.01.2021
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Форма = ЭтаФорма;
	
	Если ИмяСобытия = "смартЗапись_ЗадачаИсполнителяIECHO" 
		И НЕ Форма.Модифицированность 
		Тогда
		
		Форма.Прочитать();
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#Область Прочее

#КонецОбласти


&НаКлиенте
Процедура ОбновитьКарту(Команда)
	ОбновитьКартуСервер();
КонецПроцедуры

&НаСервере
Процедура ОбновитьКартуСервер()
	
	БП = РеквизитФормыВЗначение("Объект");
	ЭтаФорма.КартаМаршрута = БП.ПолучитьКартуМаршрута();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Записать();
	Закрыть();
КонецПроцедуры

// ++ 23.01.2021
&НаКлиенте
Процедура ПроверкаИзмененийПоБП()
	
	ЕстьМодификации = ПроверитьИзмененияНаСервере();
	
	Если ЕстьМодификации И НЕ ЭтаФорма.Модифицированность Тогда
		ЭтаФорма.Прочитать();
		ОбновитьКартуСервер();
	КонецЕсли;
	
КонецПроцедуры

// ++ 23.01.2021
&НаСервере
Функция ПроверитьИзмененияНаСервере()
	
	Результат = Ложь;
	
	Если Объект.Номенклатура <> Объект.Ссылка.Номенклатура
		ИЛИ Объект.КлиентСогласился <> Объект.Ссылка.КлиентСогласился
		ИЛИ Объект.КлиентОтказалсяОтЗаказаНаЭтапеОплаты <> Объект.Ссылка.КлиентОтказалсяОтЗаказаНаЭтапеОплаты
		ИЛИ Объект.ЗаказКлиента <> Объект.Ссылка.ЗаказКлиента
		ИЛИ Объект.ЗаказПоставщику <> Объект.Ссылка.ЗаказПоставщику
		ИЛИ Объект.Завершен <> Объект.Ссылка.Завершен Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
